# 【言語処理100本ノック 2020】第2章: UNIXコマンド

In [1]:
!wget https://nlp100.github.io/data/popular-names.txt

--2021-04-19 00:18:22--  https://nlp100.github.io/data/popular-names.txt
Resolving nlp100.github.io (nlp100.github.io)... 185.199.109.153, 185.199.110.153, 185.199.111.153, ...
Connecting to nlp100.github.io (nlp100.github.io)|185.199.109.153|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 55026 (54K) [text/plain]
Saving to: ‘popular-names.txt.2’

popular-names.txt.2 100%[===================>]  53.74K  --.-KB/s    in 0.04s

2021-04-19 00:18:27 (1.40 MB/s) - ‘popular-names.txt.2’ saved [55026/55026]

### 10. 行数のカウント
行数をカウントせよ．確認にはwcコマンドを用いよ．

In [2]:
pwd

'/home/work/work/Problem_100/nlp_100'

In [3]:
# pandas

import pandas as pd

df_master = pd.read_table("popular-names.txt", header=None, sep='\t', names=['name', 'sex', 'number', 'year'])
df = df_master.copy()
len(df)

2780

In [4]:
#UNIXコマンド
!wc -l popular-names.txt

2780 popular-names.txt

### 11. タブをスペースに置換
タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ．

In [5]:
# pandas
df.head(5)

        name sex  number  year
0       Mary   F    7065  1880
1       Anna   F    2604  1880
2       Emma   F    2003  1880
3  Elizabeth   F    1939  1880
4     Minnie   F    1746  1880

In [6]:
#UNIXコマンド
!sed -e 's/\s/ /g' popular-names.txt | head -n 5

Mary F 7065 1880
Anna F 2604 1880
Emma F 2003 1880
Elizabeth F 1939 1880
Minnie F 1746 1880
sed: couldn't write 18 items to stdout: Broken pipe

### 12. 1列目をcol1.txtに，2列目をcol2.txtに保存
各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ

In [7]:
# pandas
col1_p = df["name"]
col2_p = df["sex"]

col1_p.to_csv("./col1_p.txt")
col2_p.to_csv("./col2_p.txt")

In [8]:
#UNIXコマンド
!cut -f 1 ./popular-names.txt > ./col1.txt
!cat ./col1_chk.txt | head -n 5

cat: ./col1_chk.txt: No such file or directory

In [9]:
#UNIXコマンド
!cut -f 2 ./popular-names.txt > ./col2.txt
!cat ./col2_chk.txt | head -n 5

cat: ./col2_chk.txt: No such file or directory

### 13. col1.txtとcol2.txtをマージ
12で作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ．

In [10]:
# pandas
pd.concat([col1_p,col2_p], axis=1).head()

        name sex
0       Mary   F
1       Anna   F
2       Emma   F
3  Elizabeth   F
4     Minnie   F

In [11]:
#UNIXコマンド
!paste col1.txt col2.txt | head -n 5

Mary	F
Anna	F
Emma	F
Elizabeth	F
Minnie	F
paste: write error: Broken pipe
paste: write error

### 14. 先頭からN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ．

In [12]:
# pandas
N = 3
df.head(N)

   name sex  number  year
0  Mary   F    7065  1880
1  Anna   F    2604  1880
2  Emma   F    2003  1880

In [13]:
# UNIXコマンド
!head -n 5 popular-names.txt

Mary	F	7065	1880
Anna	F	2604	1880
Emma	F	2003	1880
Elizabeth	F	1939	1880
Minnie	F	1746	1880

### 15. 末尾のN行を出力
自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ．

In [14]:
# pandas
N = 3
df.tail(N)

       name sex  number  year
2777  Lucas   M   12585  2018
2778  Mason   M   12435  2018
2779  Logan   M   12352  2018

In [15]:
# UNIXコマンド
!tail -n 3 popular-names.txt

Lucas	M	12585	2018
Mason	M	12435	2018
Logan	M	12352	2018

### 16. ファイルをN分割する
自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN分割せよ．同様の処理をsplitコマンドで実現せよ．

In [16]:
# Pandas
import numpy as np

# 指定した整数でファイルを分割する関数
def spl(x, N):
    df_list = []
    # カットする幅を計算。
    a = np.round(len(df)/N).astype(int)
    # 指定幅でファイルをカットしてリストに格納。
    for i in range(N):
        if i == 0:
            df_list.append(df[:a])
        else:
            df_list.append(df[a*i:(a*(i+1))])
    
    # 端数を最後のファイルに追加する。
    b = len(df_list[0] + df_list[1] + df_list[2]) - len(df)
    if b != 0:
        df_list[-1] = df_list[-1] + df[-b:]
    return df_list


N = 10
cut_df = spl(df, N)
cut_df[6]

         name sex  number  year
1668   Sandra   F   21619  1963
1669  Cynthia   F   21593  1963
1670  Michael   M   83782  1963
1671     John   M   78625  1963
1672    David   M   78467  1963
...       ...  ..     ...   ...
1941  Melissa   F   26886  1977
1942      Amy   F   26732  1977
1943  Jessica   F   24843  1977
1944  Heather   F   23777  1977
1945   Angela   F   20996  1977

[278 rows x 4 columns]

In [17]:
# 解答
def split_file(N):
  tmp = df.reset_index(drop=False)
  df_cut = pd.qcut(tmp.index, N, labels=[i for i in range(N)])
  df_cut = pd.concat([df, pd.Series(df_cut, name='sp')], axis=1)

  return df_cut

df_cut = split_file(5)
print(df_cut['sp'].value_counts())

0    556
1    556
2    556
3    556
4    556
Name: sp, dtype: int64

In [18]:
# UNIXコマンド
!split -l 200 -d ./popular-names.txt sp

### 17. １列目の文字列の異なり
1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ．

In [19]:
# pandas
print(len(df.drop_duplicates(subset='name')))

136

In [20]:
# UNIXコマンド
!cut -f 1 ./popular-names.txt | sort | uniq | wc -l

136

### 18. 各行を3コラム目の数値の降順にソート
各行を3コラム目の数値の逆順で整列せよ（注意: 各行の内容は変更せずに並び替えよ）．確認にはsortコマンドを用いよ（この問題はコマンドで実行した時の結果と合わなくてもよい）．

In [21]:
# pandas
df.sort_values("number", ascending=False, inplace=True)
df.head()

         name sex  number  year
1340    Linda   F   99689  1947
1360    Linda   F   96211  1948
1350    James   M   94757  1947
1550  Michael   M   92704  1957
1351   Robert   M   91640  1947

In [22]:
# UNIXコマンド
!cat ./popular-names.txt | sort -rnk 3 | head -n 5

Linda	F	99689	1947
Linda	F	96211	1948
James	M	94757	1947
Michael	M	92704	1957
Robert	M	91640	1947
sort: write failed: 'standard output': Broken pipe
sort: write error

### 19. 各行の1コラム目の文字列の出現頻度を求め，出現頻度の高い順に並べる
各行の1列目の文字列の出現頻度を求め，その高い順に並べて表示せよ．確認にはcut, uniq, sortコマンドを用いよ．

In [23]:
# pandas 
df["name"].value_counts()

James      118
William    111
John       108
Robert     108
Mary        92
          ...
Scott        1
Carolyn      1
Rachel       1
Pamela       1
Crystal      1
Name: name, Length: 136, dtype: int64

In [24]:
# UNIXコマンド
!cut -f 1 ./popular-names.txt | sort | uniq -c | sort -rn | head -n 5

    118 James
    111 William
    108 Robert
    108 John
     92 Mary